def area(a, b):
    """
    Вычисляет площадь прямоугольника.
    
    	Параметры:
    		a (int): Первая сторона прямоугольника.
    		b (int): Вторая сторона прямоугольника.
    
    	Возвращает:
    		int: Площадь прямоугольника.
    """
    return a * b

def perimeter(a, b):
    """
    Вычисляет периметр прямоугольника.

    	Параметры:
    		a (int): Первая сторона прямоугольника.
    		b (int): Вторая сторона прямоугольника.
    
    	Возвращает:
    		int: Периметр прямоугольника.
    """
    return (a + b) * 2