def area(a, h):
    """
    Вычисляет площадь треугольника.
    
   	 Параметры:
    		a (int): Длина стороны треугольника.
    		h (int): Высота, проведённая к стороне 'a'.
    
    	Возвращает:
    		int: Площадь треугольника.
    """
    return a * h / 2

def perimeter(a, b, c):
    """
    Вычисляет периметр треугольника.


    
    	Параметры:
    		a (int): Первая сторона треугольника.
 		b (int): Вторая сторона треугольника.
    		c (int): Третья сторона треугольника.
    
    	Возвращает:
    		int: Периметр треугольника.
    """
    return a + b + c
